In [11]:
# Concatenating Data
# Creating dictionary

temperature1 = {"Date" : [2010-1-30, 2010-1-30],
               "Element":["tmax", "tmin"],
                "value":[27.8, 14.5]}


temperature2 = {"Date" : [2010-1-30, 2010-1-30],
               "Element":["tmax", "tmin"],
                "value":[27.3, 14.4]}

print(temperature1)
print(temperature2)
type(temperature1)

{'Date': [1979, 1979], 'Element': ['tmax', 'tmin'], 'value': [27.8, 14.5]}
{'Date': [1979, 1979], 'Element': ['tmax', 'tmin'], 'value': [27.3, 14.4]}

dict

In [14]:
import pandas as pd

temp_data1 = pd.DataFrame(temperature1)
temp_data2 = pd.DataFrame(temperature2)

print(temp_data1)
print(temp_data2)

   Date Element  value
0  1979    tmax   27.8
1  1979    tmin   14.5
   Date Element  value
0  1979    tmax   27.3
1  1979    tmin   14.4

In [16]:
temp_concat = pd.concat([temp_data1, temp_data2], ignore_index=True)

print(temp_concat)

   Date Element  value
0  1979    tmax   27.8
1  1979    tmin   14.5
2  1979    tmax   27.3
3  1979    tmin   14.4

In [18]:
# Concatenating dataFrames

# First we will first create the dictionary then we convert it into Dataframe

person = {"Country":["AD", "AE", "AF", "AD", "AE", "AF"],
          "Year":[2000, 2000, 2002, 2006, 2009, 2017],
          "Variable": ["m014", "m014", "m014", "m1524", "m1524", "m1524"],
          "Value": [0, 2, 52, 0, 4, 228]}
print(person)

detail = {"Age_group":[14, 14, 14, 24, 26, 27],
           "Sex":["m", "m", "f", "m", "f", "f"]}
print(detail)

{'Country': ['AD', 'AE', 'AF', 'AD', 'AE', 'AF'], 'Year': [2000, 2000, 2002, 2006, 2009, 2017], 'Variable': ['m014', 'm014', 'm014', 'm1524', 'm1524', 'm1524'], 'Value': [0, 2, 52, 0, 4, 228]}
{'Age_group': [14, 14, 14, 24, 26, 27], 'Sex': ['m', 'm', 'f', 'm', 'f', 'f']}

In [19]:
person1 = pd.DataFrame(person)
detail1 = pd.DataFrame(detail)

print(person1)
print(detail1)

  Country  Year Variable  Value
0      AD  2000     m014      0
1      AE  2000     m014      2
2      AF  2002     m014     52
3      AD  2006    m1524      0
4      AE  2009    m1524      4
5      AF  2017    m1524    228
   Age_group Sex
0         14   m
1         14   m
2         14   f
3         24   m
4         26   f
5         27   f

In [23]:
# Important : Axis=0, to stake the dataframe on teop of each other, Axis=1, to place the dataframe side by side.
person_detail = pd.concat([person1, detail1], axis=1)

print(person_detail)

  Country  Year Variable  Value  Age_group Sex
0      AD  2000     m014      0         14   m
1      AE  2000     m014      2         14   m
2      AF  2002     m014     52         14   f
3      AD  2006    m1524      0         24   m
4      AE  2009    m1524      4         26   f
5      AF  2017    m1524    228         27   f

In [30]:
person_detail[person_detail.Value > 2]

  Country  Year Variable  Value  Age_group Sex
2      AF  2002     m014     52         14   f
4      AE  2009    m1524      4         26   f
5      AF  2017    m1524    228         27   f

In [31]:
# Globbing, Find and concatenate
# Finding differet types of csv file

import glob

csv_files = glob.glob('*.csv')

print(csv_files)

['bayya.csv', 'deliverable.csv', 'tidy.csv', 'weatherdata.csv', 'world_ind_pop_data.csv']

In [42]:
# using loops

list_data = []
for filename in csv_files:
    data = pd.read_csv('weatherdata.csv')
    list_data.append(data)
pd.concat(list_data)

data.head(10)

         date  temperaturemin  temperaturemax  precipitation  snowfall
0  2007-01-09            30.0            55.0           0.00         0
1  2007-01-22            33.1            41.0           0.08         0
2  2007-01-27            32.0            64.0           0.00         0
3  2007-01-30            24.1            48.9           0.00         0
4  2007-02-08            27.0            48.0           0.00         0
5  2007-02-13            37.9            50.0           0.59         0
6  2007-02-17            19.0            48.0           0.00         0
7  2007-02-21            50.0            73.0           0.01         0
8  2007-02-23            37.0            55.0           0.00         0
9  2007-02-28            37.9            61.0           0.00         0

In [8]:
# Merge Data
# --- Combining Data----
# Concatenation is not the only way data can be combined 
# -----> From directory -- to --- Data Frame -- to -- Merge data

population = {"State":["California", "Texas", "Florida", "New York"],
         "Population":[39250017, 27862596, 20612439, 19745289]}

print(population)

state = {"Name":["California", "Florida", "New York", "Texas"],
         "ANSI":["CA", "FL", "NY", "TX"]}

print(state)

{'State': ['California', 'Texas', 'Florida', 'New York'], 'Population': [39250017, 27862596, 20612439, 19745289]}
{'Name': ['California', 'Florida', 'New York', 'Texas'], 'ANSI': ['CA', 'FL', 'NY', 'TX']}

In [9]:
import pandas as pd

population1 = pd.DataFrame(population)

print(population1)

state1 = pd.DataFrame(state)

print(state1)

        State  Population
0  California    39250017
1       Texas    27862596
2     Florida    20612439
3    New York    19745289
         Name ANSI
0  California   CA
1     Florida   FL
2    New York   NY
3       Texas   TX

In [11]:
# Merging Data, similar to joining tables in SQL
# Combine disperate datasets based on common columns

pd.merge(left=population1, right=state1, on=None, left_on='State', right_on='Name')

# For more type of merges see CONCAT FILE ON GITHUB/BAYYARAGHU

        State  Population        Name ANSI
0  California    39250017  California   CA
1       Texas    27862596       Texas   TX
2     Florida    20612439     Florida   FL
3    New York    19745289    New York   NY